[
  {
    "code": "MATH1225",
    "name": "Calculus of a Single Variable",
    "credits": [
      4
    ],
    "prerequisites": [
      [
        "AB4",
        "SUB4",
        "AB4",
        "BC3",
        "BC3",
        "MATH1214"
      ]
    ],
    "corequisites": [],
    "category": "Core Mathematics",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "1225-1226: CALCULUS OF A SINGLE VARIABLE Quantitative and computational thinking to address relevant intercultural and global issues. Unified calculus course covering techniques of differential and integral calculus for functions of one variable. Constitutes the standard first-year mathematics courses for science and engineering. 1225: limits, continuity, differentiation, transcendental functions, applications of differentiation, introduction to integration. Assumes 2 units of high school algebra, 1 unit of geometry, 1/2 unit each of trigonometry and precalculus, and placement by Math Dept. 1226: techniques and applications of integration, trapezoidal and Simpson’s rules, improper integrals, sequences and series, power series, parametric curves and polar coordinates, software-based techniques. A student can earn credit for at most one of 1025 and 1225. A student can earn credit for at most one of 1525 and 1225. A student can earn credit for at most one of 1026 and 1226. Pre: Grade of at least C- in 1225 for 1226.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "MATH1226",
    "name": "Calculus of a Single Variable",
    "credits": [
      4
    ],
    "prerequisites": [
      [
        "MATH1225"
      ]
    ],
    "corequisites": [],
    "category": "Core Mathematics",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "1225-1226: CALCULUS OF A SINGLE VARIABLE Quantitative and computational thinking to address relevant intercultural and global issues. Unified calculus course covering techniques of differential and integral calculus for functions of one variable. Constitutes the standard first-year mathematics courses for science and engineering. 1225: limits, continuity, differentiation, transcendental functions, applications of differentiation, introduction to integration. Assumes 2 units of high school algebra, 1 unit of geometry, 1/2 unit each of trigonometry and precalculus, and placement by Math Dept. 1226: techniques and applications of integration, trapezoidal and Simpson’s rules, improper integrals, sequences and series, power series, parametric curves and polar coordinates, software-based techniques. A student can earn credit for at most one of 1025 and 1225. A student can earn credit for at most one of 1525 and 1225. A student can earn credit for at most one of 1026 and 1226. Pre: Grade of at least C- in 1225 for 1226.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "MATH2214",
    "name": "Intro Diff Equations",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "MATH2114",
        "MATH2114",
        "MATH2405"
      ],
      [
        "MATH1226"
      ]
    ],
    "corequisites": [],
    "category": "Core Mathematics",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Unified course in ordinary differential equations. First-order equations, second-and-higher-order constant coefficient linear equations, systems of first-order linear equations, and numerical methods. Mathematical models describing motion and cooling, predator-prey population models, SIR-models, mechanical vibrations, electric circuits, rates of chemical reactions, radioactive decay. Quantitative and computational thinking to address relevant intercultural and global issues. A student can earn credit for at most one of 2214 and 2406H. A student can earn credit for at most one of 2214 and CMDA 2006.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "MATH2534",
    "name": "Intro Discrete Math",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "CS1114",
        "ECE1574",
        "ECE1004",
        "CS2064"
      ]
    ],
    "corequisites": [],
    "category": "Core Mathematics",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Emphasis on topics relevant to computer science. Topics include logic, propositional calculus, set theory, relations, functions, mathematical induction, elementary number theory and Boolean algebra. Does not carry credit for mathematics majors, but may be used as though it were a 3000-level elective course for the mathematics minor. Two units of high school algebra, one unit of geometry, one-half unit each of trigonometry and precalculus mathematics required. 2534 may not be taken by math majors for credit without special permission. A student can earn credit for at most one of 2534 and 3034.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "STAT3704",
    "name": "Stat for Eng Apps",
    "credits": [
      2
    ],
    "prerequisites": [
      [
        "MATH2224",
        "MATH2224",
        "MATH2204",
        "MATH2204",
        "MATH2406",
        "CMDA2005"
      ]
    ],
    "corequisites": [],
    "category": "Core Mathematics",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Introduction to statistical methodology with emphasis on engineering experimentation: probability distributions, estimation, hypothesis testing, regression, and analysis of variance. Only one of the courses 3704, 4604, 4705, and 4714 may be taken for credit.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "MATH2204",
    "name": "Intro Multivariable Calculus",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "MATH1226"
      ]
    ],
    "corequisites": [],
    "category": "Core Mathematics",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Calculus for functions for several variables. Planes and surfaces, continuity, differentiation, chain rule, extreme values, Lagrange multipliers, double and triple integrals and applications, software-based techniques. A student can earn credit for at most one of 2204 and 2406H. A student can earn credit for at most one of 2024 and 2204. A student can earn credit for at most one of 2204 and CMDA 2005.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "MATH2114",
    "name": "Introduction to Linear Algebra",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "MATH1225",
        "MATH1226",
        "AB5"
      ]
    ],
    "corequisites": [],
    "category": "Core Mathematics",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Vector and matrix algebra systems of linear equations, linear equations, linear independence, bases, orthonormal bases, rank, linear transformations, diagonalization, implementation with contemporary software. Math 1226 or a grade of at least B in VT MATH 1225. A student can earn credit for at most one of 2114 and 2405H.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CS1114",
    "name": "Intro to Software Design",
    "credits": [
      3
    ],
    "prerequisites": [],
    "corequisites": [],
    "category": "Core CS",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Fundamental concepts of programming from an object-oriented perspective. Basic software engineering principles and programming skills in a programming language that supports the object-oriented paradigm. Simple data types, control structures, array and string data structures, basic algorithms, testing and debugging. A basic model of the computer as an abstract machine. Modeling and problem-solving skills applicable to programming at this level. Partially duplicates 1054, 1124, and 1705.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CS2104",
    "name": "Intro to Problem Solving in CS",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "MATH1205",
        "MATH1225",
        "MATH1526"
      ],
      [
        "CS1114",
        "CS2064",
        "ECE2514"
      ]
    ],
    "corequisites": [],
    "category": "Core CS",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "This course introduces the student to a broad range of heuristics for solving problems in a range of settings that are relevant to computation. Emphasis on problem-solving techniques that aid programmers and computer scientists. Heuristics for solving problems in the small (classical math and word problems), generating potential solutions to real-life problems encountered in the profession, problem solving through computation, and problem solving in teams.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CS2505",
    "name": "Intro Computer Organization",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "CS2114"
      ]
    ],
    "corequisites": [],
    "category": "Core CS",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "An introduction to the design and operation of digital computers. Works up from the logic gate level to combinational and sequential circuits, information representation, computer arithmetic, arithmetic/logic units, control unit design, basic computer organization, relationships between high level programming languages and instruction set architectures. A grade of C or better is required in CS prerequisite. Corequisites: MATH 2534 or MATH 3034.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CS2506",
    "name": "Intro to Computer Organization",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "CS2114",
        "ECE3514"
      ],
      [
        "CS2505",
        "ECE2564"
      ],
      [
        "MATH2534",
        "MATH3034"
      ]
    ],
    "corequisites": [],
    "category": "Core CS",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "An introduction to the design and operation of digital computers. Instruction formats and construction, addressing modes, instruction execution, memory hierarchy operation and performance, pipelining, input/output, and the relationships between high level programming languages and machine language. A grade of C or better is required in CS pre-requisite 2505 and 2114.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CS3214",
    "name": "Computer Systems",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "CS2506"
      ],
      [
        "CS2114",
        "ECE2564"
      ],
      [
        "ECE3574"
      ]
    ],
    "corequisites": [],
    "category": "Core CS",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Introduction to computer systems as they are relevant to application programmers today, with emphasis on operating system principles. Operating system design and architectures; processes; threads, synchronization techniques, deadlock; CPU scheduling; system call interfaces, system level I/O and file management; shell programming; separate compilation, loading and linking; inter-process communication (IPC); virtual and physical memory management and garbage collection; network protocols and programming; virtualization; performance analysis and optimization. A grade of C or better is required in CS pre-requisites 2506 and 2114.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CS3304",
    "name": "Comparative Languages",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "CS3114"
      ]
    ],
    "corequisites": [],
    "category": "Core CS",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "This course in programming language constructs emphasizes the run-time behavior of programs. The languages are studied from two points of view: (1) the fundamental elements of languages and their inclusion in commercially available systems; and (2) the differences between implementations of common elements in languages. A grade of C or better required in CS prerequisite 3114.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CS3604",
    "name": "Professionalism in Computing",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "CS1944"
      ],
      [
        "CS2114",
        "ECE3514"
      ],
      [
        "COMM2004",
        "COMM2014"
      ]
    ],
    "corequisites": [],
    "category": "Core CS",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Studies the ethical, social, and professional concerns of the computer science field. Covers the social impact of the computer, implications and effects of computers on society, and the responsibilities of computer professionals in directing the emerging technology. The topics are studied through case studies of reliable, risk-free technologies, and systems that provide user friendly processes. Specific studies are augmented by an overview of the history of computing, interaction with industrial partners and computing professionals, and attention to the legal and ethical responsibilities of professionals. This is a web-supported course, incorporating writing intensive exercises, making extensive use of active learning technologies. A grade of C or better required in CS prerequisite 3114.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CHEM1035",
    "name": "General Chemistry",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "AP4",
        "AB4",
        "AB4",
        "BC3",
        "BC3",
        "CHEM1014",
        "MATH1014",
        "MATH1025",
        "MATH1536",
        "MATH1225",
        "MATH1214",
        "MATH1524"
      ]
    ],
    "corequisites": [],
    "category": "Foundation",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "First chemistry course for students in science curricula. Applications of reasoning in the natural sciences using chemical laws in an applied context and in the student’s own discipline. Overview of the universal aspects of chemistry and of application of chemistry to address global challenges. 1035: Problem-solving, elements and periodic table, stoichiometry of chemical reactions, gas phase of matter, energy flow and chemical change, atomic structure, and theories of chemical bonding. 1036: Properties of the three states of matter alone and in mixtures, kinetics, aqueous equilibrium, thermodynamics, electrochemistry. (Duplicates 1015-1016.) Students may bypass prerequisites for 1035 through testing alternatives listed in the Registrar’s Timetable.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "CHEM1045",
    "name": "General Chemistry Laboratory",
    "credits": [
      1
    ],
    "prerequisites": [
      [
        "AP4",
        "AB4",
        "AB4",
        "BC3",
        "BC3",
        "CHEM1014",
        "MATH1014",
        "MATH1025",
        "MATH1536",
        "MATH1225",
        "MATH1214",
        "MATH1524"
      ]
    ],
    "corequisites": [],
    "category": "Foundation",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Hands-on, real-world activities that illustrate and elaborate on concepts taught in general chemistry lecture (1035-1036), including acids and bases, heat capacity, ideal gases, states of matter, concentration, mixtures, energy flow and spontaneity in processes, equilibrium, kinetics, colligative properties, and electrochemistry. Use of instrumentation to analyze water and soil contaminants, biofuel mixtures, nanoparticles, and polymer properties. Laboratory safety, chemical hygiene, hazard mitigation, waste management, and the influence of procedure on experimental outcomes. Global challenges, including recycling and sustainable energy sources, water resource management, global warming, and environmentally friendly reagents in chemical contexts. Use of computers in data analysis, collaboration, and report-writing.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "PHYS2305",
    "name": "Foundations of Physics",
    "credits": [
      0
    ],
    "prerequisites": [
      [
        "MATH1225"
      ]
    ],
    "corequisites": [],
    "category": "Foundation",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "Introductory sequence for students in physical sciences, mathematics, and engineering. Overview of intercultural contributions to physics and universal aspects of physics, and of human benefits of physics to address world-wide challenges. 2305: classical mechanics of translational and rotational motion, Newtonian gravitation, and thermal physics. 2306: oscillations, waves, electricity, magnetism, and optics.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "ENGL1105",
    "name": "First-Year Writing",
    "credits": [
      3
    ],
    "prerequisites": [],
    "corequisites": [],
    "category": "Foundation",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "1105: Introduction to rhetorical analysis, visual rhetoric, critical writing, and critical thinking; intensive reading of works in multiple genres; practice in writing and revision; fundamentals of oral presentations. 1106: Continued study in rhetorical analysis and the conventions of various genres; intensive instruction in writing and revision of work that incorporates research; experience in oral presentations.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "ENGL1106",
    "name": "First-Year Writing",
    "credits": [
      3
    ],
    "prerequisites": [
      [
        "ENGL1105"
      ]
    ],
    "corequisites": [],
    "category": "Foundation",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "1105: Introduction to rhetorical analysis, visual rhetoric, critical writing, and critical thinking; intensive reading of works in multiple genres; practice in writing and revision; fundamentals of oral presentations. 1106: Continued study in rhetorical analysis and the conventions of various genres; intensive instruction in writing and revision of work that incorporates research; experience in oral presentations.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "ENGE1215",
    "name": "Foundations of Engineering",
    "credits": [
      2
    ],
    "prerequisites": [],
    "corequisites": [],
    "category": "Foundation",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "A ﬁrst-year sequence to introduce general engineering students to the profession. 1215 (2 credit) Engineering problem-solving, contemporary programming tools, professional practices and expectations (e.g. effective communication, time management, working in teams, ethics), the diversity of ﬁelds and majors within engineering, and reflective and corrective practices. 1216 (2 credits): Engineering design, criteria and constraints, data collection and analysis, testing and iteration of design solutions, contemporary CAD tools, professional practices and expectations (e.g. communication, teamwork, ethics), and reflective and corrective practices. Students must complete both ENGE 1215 and ENGE 1216 to earn Pathways credit. 1215: Design Lab/Studio, 1216: Design Lab/Studio. Duplicates ENGE 1414.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  },
  {
    "code": "ENGE1216",
    "name": "Foundations of Engineering",
    "credits": [
      2
    ],
    "prerequisites": [
      [
        "ENGE1215"
      ]
    ],
    "corequisites": [],
    "category": "Foundation",
    "semesters": [
      "Fall",
      "Spring"
    ],
    "description": "A ﬁrst-year sequence to introduce general engineering students to the profession. 1215 (2 credit) Engineering problem-solving, contemporary programming tools, professional practices and expectations (e.g. effective communication, time management, working in teams, ethics), the diversity of ﬁelds and majors within engineering, and reflective and corrective practices. 1216 (2 credits): Engineering design, criteria and constraints, data collection and analysis, testing and iteration of design solutions, contemporary CAD tools, professional practices and expectations (e.g. communication, teamwork, ethics), and reflective and corrective practices. Students must complete both ENGE 1215 and ENGE 1216 to earn Pathways credit. 1215: Design Lab/Studio, 1216: Design Lab/Studio. Duplicates ENGE 1414.",
    "pathways": [
      "G01F",
      "G01A",
      "G02",
      "G03",
      "G04",
      "G05F",
      "G05A",
      "G06D",
      "G06A"
    ]
  }
]